#pragma once

#include <DXLib.h>
#include "Drawer.h"
#include "Player.h"
#include "Enemy.h"

//==デバックモードを管理するクラス
class Debuger: public Drawer {
	Player* _player;
	Enemy* _enemy;
public:
	//------------------------------------------------
	//--コンストラクタ・デストラクタ
	Debuger( Player* player, Enemy* enemy );
	~Debuger( );
	//------------------------------------------------
	//------------------------------------------------


	//------------------------------------------------
	//--ゲッター
	//------------------------------------------------
	//------------------------------------------------


	//------------------------------------------------
	//--セッター
	//------------------------------------------------
	//------------------------------------------------


	void Debug( int distance, int pPosIndex, int ePosIndex );										//--デバックモードを表示する関数
};

