#pragma once

#include <DXLib.h>

//==エネミーを管理するクラス
class Enemy {
	VECTOR _position;				//エネミーの座標
public:
	//---------------------------------------------------
	//--コンストラクタ・デストラクタ
	Enemy( );
	~Enemy( );
	//---------------------------------------------------
	//---------------------------------------------------


	//---------------------------------------------------
	//--ゲッター
	VECTOR GetEnemyPosition( );
	//---------------------------------------------------
	//---------------------------------------------------


	//---------------------------------------------------
	//--セッター
	//---------------------------------------------------

	//---------------------------------------------------
	//---------------------------------------------------


	void MoveForwardPixel( int pixel );					//--前方にpixelピクセル移動する関数
	void MoveLeftPixel   ( int pixel );					//--左　にpixelピクセル移動する関数
	void MoveRightPixel  ( int pixel );					//--右　にpixelピクセル移動する関数
};

