#include "Enemy.h"

//---------------------------------------------------
//--コンストラクタ・デストラクタ
Enemy::Enemy( ) {
	_position = VGet( 0, 0, 0 );
}


Enemy::~Enemy( ) {
}
//---------------------------------------------------
//---------------------------------------------------


//---------------------------------------------------
//--ゲッター
VECTOR Enemy::GetPosition( ) {
	return _position;
}
//---------------------------------------------------
//---------------------------------------------------


//---------------------------------------------------
//--セッター
//---------------------------------------------------

//---------------------------------------------------
//---------------------------------------------------


//--前方にpixelピクセル移動する関数
void Enemy::MoveForwardPixel( int pixel ) {
	_position.z += pixel;
}


//--左　にpixelピクセル移動する関数
void Enemy::MoveLeftPixel   ( int pixel ) {
	_position.x -= pixel;
}


//--右　にpixelピクセル移動する関数
void Enemy::MoveRightPixel  ( int pixel ) {
	_position.x += pixel;
}