#pragma once

#include "SceneManager.h"


//==GameStartシーンを管理するクラス
class GameStartManager : public SceneManager {
	bool _BGMsounded;				//BGMを一回だけならすための変数
	bool _pushed;					//ボタンを押したかどうかのフラグ
public:
	//-------------------------------
	//コンストラクタ・デストラクタ
	GameStartManager( Drawer* drawer, InputChecker* inputChecker, Sounder* sounder );
	~GameStartManager( );
	//-------------------------------
	//-------------------------------


	//--------------------------------------------
	//--ゲッター
	//--------------------------------------------
	//--------------------------------------------


	//--------------------------------------------
	//--セッター
	//--------------------------------------------
	//--------------------------------------------


	 void Main( );		//--メイン関数
};

